<!-- terraform cdk action for options with hash 0d855fa9b0c377767ce986776c53ddef -->
### ✅ Successfully planned Terraform CDK Stack 'graasp-dev'



<details><summary>Show Plan</summary>

```shell
graasp-dev  Initializing the backend...
graasp-dev  Successfully configured the backend "s3"! Terraform will automatically
            use this backend unless the backend configuration changes.
graasp-dev  Initializing modules...
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/rds/aws 6.10.0 for graasp-dev-postgres_db_F1D5DB7A...
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_instance in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_instance
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_instance_role_association in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_instance_role_association
            - graasp-dev-postgres_db_F1D5DB7A.db_option_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_option_group
            - graasp-dev-postgres_db_F1D5DB7A.db_parameter_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_parameter_group
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_subnet_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_subnet_group
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 5.21.0 for vpc...
graasp-dev  - vpc in .terraform/modules/vpc
graasp-dev  Initializing provider plugins...
graasp-dev  - Finding hashicorp/random versions matching ">= 3.1.0"...
graasp-dev  - Finding hashicorp/aws versions matching ">= 5.59.0, >= 5.62.0, >= 5.79.0, 5.91.0"...
graasp-dev  - Installing hashicorp/random v3.7.2...
graasp-dev  - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
graasp-dev  - Installing hashicorp/aws v5.91.0...
graasp-dev  - Installed hashicorp/aws v5.91.0 (signed by HashiCorp)
            Terraform has created a lock file .terraform.lock.hcl to record the provider
            selections it made above. Include this file in your version control repository
            so that Terraform can guarantee to make the same selections by default when
            you run "terraform init" in the future.

            Terraform has been successfully initialized!

            You may now begin working with Terraform. Try running "terraform plan" to see
            any changes that are required for your infrastructure. All Terraform commands
            should now work.

            If you ever set or change modules or backend configuration for Terraform,
            rerun this command to reinitialize your working directory. If you forget, other
            commands will detect it and remind you to do so if necessary.
graasp-dev  - Fetching hashicorp/aws 5.91.0 for linux_amd64...
graasp-dev  - Retrieved hashicorp/aws 5.91.0 for linux_amd64 (signed by HashiCorp)
graasp-dev  - Fetching hashicorp/random 3.7.2 for linux_amd64...
graasp-dev  - Retrieved hashicorp/random 3.7.2 for linux_amd64 (signed by HashiCorp)
            - Obtained hashicorp/random checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
            - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
graasp-dev  Success! Terraform has validated the lock file and found no need for changes.
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=18i6pw]
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert): Reading...
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert): Read complete after 1s [id=arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_iframely-iframely-loggroup_7A5EFF5D (graasp-dev/iframely-iframely-loggroup): Refreshing state... [id=/ecs/iframely]
graasp-dev  aws_ecr_lifecycle_policy.graasp-dev-admin-ecr-lifecycle: Refreshing state... [id=graasp/admin]
            aws_ecr_repository.graasp-dev-admin-ecr: Refreshing state... [id=graasp/admin]
            aws_ecs_service.graasp-dev_admin-service_102046E6: Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/admin]
            aws_ecs_task_definition.graasp-dev_admin_965ADA45: Refreshing state... [id=admin]
            aws_security_group.graasp-dev-admin-security-group: Refreshing state... [id=sg-0f0041b09dfe508dd]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-admin-allow-load-balancer: Refreshing state... [id=sgr-00dd0db77b3d87366]
            aws_vpc_security_group_egress_rule.graasp-dev-admin-allow-all: Refreshing state... [id=sgr-00f1b05233f81218d]
            aws_vpc_security_group_ingress_rule.graasp-dev-allow-gatekeeper-on-admin: Refreshing state... [id=sgr-08f6d4ff3e4dffc83]
            aws_lb_target_group.graasp-dev_admin-target-group_02D6E066: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/admin/20b707f926558436]
graasp-dev  aws_iam_role_policy.graasp-dev_admin-ecsExec-task-policy_8B69D2B0: Refreshing state... [id=admin-ecsExec-task-role:admin-allow-ecsExec-task-policy]
graasp-dev  aws_iam_role.graasp-dev_admin-ecsExec-task-role_4A498ED2: Refreshing state... [id=admin-ecsExec-task-role]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_admin-admin-loggroup_BBF3EA20: Refreshing state... [id=/ecs/admin]
graasp-dev  aws_lb_listener_rule.graasp-dev_admin-rule_5C1B7745: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/353fcd477349a6a0]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-admin_04B093C2: Refreshing state... [id=sgr-041fc861dd71454c7]
graasp-dev  aws_service_discovery_http_namespace.graasp-dev_namespace_B6F7BA2C (graasp-dev/namespace): Refreshing state... [id=ns-us3rov3ukfoth5ox]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_graasp-nudenet-loggroup_2DD18C1A (graasp-dev/graasp-nudenet-loggroup): Refreshing state... [id=/ecs/nudenet]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=graasp-postgres15-20250414081855175500000002]
graasp-dev  aws_ecs_cluster.cluster (cluster): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:cluster/graasp-dev]
graasp-dev  aws_cloudfront_function.maintenance-check-function (maintenance-check-function): Refreshing state... [id=maintenance-check]
graasp-dev  aws_iam_role.graasp-dev_ecs-execution-role_A4D135E8 (graasp-dev/ecs-execution-role): Refreshing state... [id=graasp-dev-ecs-execution-role]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_etherpad-etherpad-loggroup_DC4C6E70 (graasp-dev/etherpad-etherpad-loggroup): Refreshing state... [id=/ecs/etherpad]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_workers-graasp-worker-loggroup_7B2C3B66 (graasp-dev/workers-graasp-worker-loggroup): Refreshing state... [id=/ecs/graasp-worker]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_partition.current: Reading...
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
            module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0bf44cfeb4bd6c5a3]
graasp-dev  aws_s3_bucket.graasp-dev-client_bucket_076446C5 (graasp-dev-client/bucket): Refreshing state... [id=graasp-dev-client]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_meilisearch-meilisearch-loggroup_68770DFD (graasp-dev/meilisearch-meilisearch-loggroup): Refreshing state... [id=/ecs/meilisearch]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_graasp-core-loggroup_49E5FDD5 (graasp-dev/graasp-core-loggroup): Refreshing state... [id=/ecs/core]
graasp-dev  data.aws_ecr_repository.graasp-dev-ecr (graasp-dev-ecr): Reading...
graasp-dev  aws_cloudwatch_log_group.graasp-dev_umami-umami-loggroup_8EC61F18 (graasp-dev/umami-umami-loggroup): Refreshing state... [id=/ecs/umami]
graasp-dev  aws_s3_bucket.graasp-dev-h5p_bucket_B545A43B (graasp-dev-h5p/bucket): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket.graasp-dev-apps_bucket_F4170225 (graasp-dev-apps/bucket): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_s3_bucket.graasp-dev-file-items_bucket_12606B30 (graasp-dev-file-items/bucket): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_s3_bucket.graasp-dev-maintenance_bucket_46B8FAD7 (graasp-dev-maintenance/bucket): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_redis-redis-loggroup_AAC20219 (graasp-dev/redis-redis-loggroup): Refreshing state... [id=/ecs/redis]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_migrate-loggroup_3BA4455E (graasp-dev/migrate-loggroup): Refreshing state... [id=/ecs/migrate]
graasp-dev  data.aws_ecr_repository.graasp-dev-ecr (graasp-dev-ecr): Read complete after 1s [id=graasp]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
            data.aws_ecr_repository.graasp-dev-etherpad-ecr (graasp-dev-etherpad-ecr): Reading...
graasp-dev  aws_s3_bucket.graasp-dev-assets_bucket_8930785E (graasp-dev-assets/bucket): Refreshing state... [id=graasp-dev-assets]
graasp-dev  data.aws_ecr_repository.graasp-dev-explore-ecr (graasp-dev-explore-ecr): Reading...
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert)-lb: Reading...
graasp-dev  data.aws_ecr_repository.graasp-dev-etherpad-ecr (graasp-dev-etherpad-ecr): Read complete after 0s [id=graasp/etherpad]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_graasp-library-graasp-library-loggroup_67C0597D (graasp-dev/graasp-library-graasp-library-loggroup): Refreshing state... [id=/ecs/graasp-library]
graasp-dev  data.aws_ecr_repository.graasp-dev-explore-ecr (graasp-dev-explore-ecr): Read complete after 0s [id=graasp/explore]
graasp-dev  aws_rds_instance_state.graasp-dev-postgres_graasp-dev-instance-state_D3812C30 (graasp-dev-postgres/graasp-dev-instance-state): Refreshing state...
graasp-dev  aws_ecs_task_definition.graasp-dev_meilisearch_38A3D0B6 (graasp-dev/meilisearch): Refreshing state... [id=meilisearch]
graasp-dev  aws_ecs_task_definition.graasp-dev_iframely_4C5E8E3D (graasp-dev/iframely): Refreshing state... [id=iframely]
graasp-dev  aws_iam_role_policy.graasp-dev_graasp-dev-ecs-execution-role-policies_D65DB830 (graasp-dev/graasp-dev-ecs-execution-role-policies): Refreshing state... [id=graasp-dev-ecs-execution-role:allow-ecr-pull]
graasp-dev  aws_ecs_task_definition.graasp-dev_redis_E9CE963D (graasp-dev/redis): Refreshing state... [id=redis]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-rds-monitoring-role]
graasp-dev  aws_ecs_task_definition.graasp-dev_graasp-library_B38B90C0 (graasp-dev/graasp-library): Refreshing state... [id=graasp-library]
graasp-dev  module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-098c10ef23e4e97a2]
graasp-dev  module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-06d794b86c4c0da00]
graasp-dev  module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-037dfd30c09bfcb76]
graasp-dev  aws_security_group.graasp-dev-workers-security-group (graasp-dev-workers-security-group): Refreshing state... [id=sg-0a5008ca479f08b55]
graasp-dev  aws_security_group.graasp-dev-lb-security-group (graasp-dev-lb-security-group): Refreshing state... [id=sg-043a4fe55b6817b2e]
graasp-dev  aws_security_group.graasp-dev-redis-security-group (graasp-dev-redis-security-group): Refreshing state... [id=sg-020ca00c65d7e1104]
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert)-lb: Read complete after 1s [id=arn:aws:acm:eu-central-1:299720865162:certificate/af9d071d-3aa1-4583-905d-ec1efd5515d3]
graasp-dev  aws_security_group.graasp-dev-etherpad-security-group (graasp-dev-etherpad-security-group): Refreshing state... [id=sg-0fb56b52d54eed5fe]
graasp-dev  aws_security_group.graasp-dev-migrate-security-group (graasp-dev-migrate-security-group): Refreshing state... [id=sg-0d16557816b4f5845]
graasp-dev  aws_security_group.graasp-dev-collab-ec2_graasp-dev-collab-ec2-security-group_B3318A54 (graasp-dev-collab-ec2/graasp-dev-collab-ec2-security-group): Refreshing state... [id=sg-07e7a273f47d0059f]
graasp-dev  aws_security_group.graasp-dev-backend-security-group (graasp-dev-backend-security-group): Refreshing state... [id=sg-0436bcdc892abda80]
graasp-dev  aws_security_group.graasp-dev-postgres_graasp-dev-db-security-group_6A637215 (graasp-dev-postgres/graasp-dev-db-security-group): Refreshing state... [id=sg-0186fec9af0593f12]
graasp-dev  aws_security_group.graasp-dev-umami-security-group (graasp-dev-umami-security-group): Refreshing state... [id=sg-00f73c597e1b44822]
graasp-dev  aws_security_group.graasp-dev-meilisearch-security-group (graasp-dev-meilisearch-security-group): Refreshing state... [id=sg-08169b93b254b8ff1]
graasp-dev  aws_security_group.graasp-dev-library-security-group (graasp-dev-library-security-group): Refreshing state... [id=sg-0aafc89bbf5739dec]
graasp-dev  aws_security_group.graasp-dev-gatekeeper_graasp-dev-gatekeeper-security-group_92E8E7CC (graasp-dev-gatekeeper/graasp-dev-gatekeeper-security-group): Refreshing state... [id=sg-0750d0af113e7da99]
graasp-dev  aws_security_group.graasp-dev-iframely-security-group (graasp-dev-iframely-security-group): Refreshing state... [id=sg-077b04c8f8e6f2ac3]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-rds-monitoring-role-20250414084120276500000001]
graasp-dev  module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01b78c34d5d13db83]
graasp-dev  module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d1e3ea211d674e32]
graasp-dev  module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03a1732c7868cbe45]
graasp-dev  module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01238f26eab523423]
graasp-dev  module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0ba3740950e70cb0c]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-workers-allow-all (graasp-dev-workers-allow-all): Refreshing state... [id=sgr-0f47b2336d6b948c6]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-http_0E987E63 (graasp-dev-load-balancer/allow-http): Refreshing state... [id=sgr-00b388210e5b20ee6]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-https_0223BC47 (graasp-dev-load-balancer/allow-https): Refreshing state... [id=sgr-01b616a803edeaaea]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-http-ipv6_91743348 (graasp-dev-load-balancer/allow-http-ipv6): Refreshing state... [id=sgr-07a0b4bf0b0b05c26]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-load-balancer_graasp-dev-allow-all_001EC5EB (graasp-dev-load-balancer/graasp-dev-allow-all): Refreshing state... [id=sgr-09bb82356feba0ad5]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-https-ipv6_DC496355 (graasp-dev-load-balancer/allow-https-ipv6): Refreshing state... [id=sgr-05d6f5da0f311d43b]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-redis-allow-graasp-workers (graasp-dev-redis-allow-graasp-workers): Refreshing state... [id=sgr-03e8a1c5d35d7f3c3]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-redis-allow-all (graasp-dev-redis-allow-all): Refreshing state... [id=sgr-0412ca85ae48a1b51]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-etherpad-allow-all (graasp-dev-etherpad-allow-all): Refreshing state... [id=sgr-0f73c6c3f604ce026]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-etherpad-allow-load-balancer (graasp-dev-etherpad-allow-load-balancer): Refreshing state... [id=sgr-0038ad3fb0fd9b85c]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-client_s3-bucket-ownership_7FA8E504 (graasp-dev-client/s3-bucket-ownership): Refreshing state... [id=graasp-dev-client]
graasp-dev  data.aws_iam_policy_document.graasp-dev-client_allow_public_access_BCCA7882 (graasp-dev-client/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-client_allow_public_access_BCCA7882 (graasp-dev-client/allow_public_access): Read complete after 0s [id=3742575001]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-client_s3-website-configuration_A6D7BA4D (graasp-dev-client/s3-website-configuration): Refreshing state... [id=graasp-dev-client]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-client_s3-block-public-access_A8DD5DF0 (graasp-dev-client/s3-block-public-access): Refreshing state... [id=graasp-dev-client]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-migrate-allow-all (graasp-dev-migrate-allow-all): Refreshing state... [id=sgr-0a1a3408abed57c60]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-migrate-allow-load-balancer (graasp-dev-migrate-allow-load-balancer): Refreshing state... [id=sgr-00a9608239e7b401e]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-collab-ec2_graasp-dev-collab-ec2-allow-load-balancer_5A9E5B7D (graasp-dev-collab-ec2/graasp-dev-collab-ec2/graasp-dev-collab-ec2-allow-load-balancer): Refreshing state... [id=sgr-0335bfdb2cc780431]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-collab-ec2_graasp-dev-collab-ec2-allow-all_EAB27BEF (graasp-dev-collab-ec2/graasp-dev-collab-ec2-allow-all): Refreshing state... [id=sgr-01760ca1d2b09b31d]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-collab-ec2_graasp-dev-collab-ec2-allow-inbound-ssh_3DB04F43 (graasp-dev-collab-ec2/graasp-dev-collab-ec2/graasp-dev-collab-ec2-allow-inbound-ssh): Refreshing state... [id=sgr-0fadcf8107635838d]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-backend-allow-all (graasp-dev-backend-allow-all): Refreshing state... [id=sgr-07ece93d643cfee3b]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-redis-allow-graasp-backend (graasp-dev-redis-allow-graasp-backend): Refreshing state... [id=sgr-0d733de6d47147a48]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-backend-allow-load-balancer (graasp-dev-backend-allow-load-balancer): Refreshing state... [id=sgr-0f1f77b71f42b1d09]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-graasp-migrate_3CAD125A (graasp-dev-postgres/graasp-dev-db-allow-graasp-migrate): Refreshing state... [id=sgr-091095b461efdaf81]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-graasp-backend_E8883EF3 (graasp-dev-postgres/graasp-dev-db-allow-graasp-backend): Refreshing state... [id=sgr-0c8a4b2f6cbb26e73]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-graasp-workers_FD8833CD (graasp-dev-postgres/graasp-dev-db-allow-graasp-workers): Refreshing state... [id=sgr-01793faf4d2f17a65]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-etherpad_A95D382C (graasp-dev-postgres/graasp-dev-db-allow-etherpad): Refreshing state... [id=sgr-08c74707423701596]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-collab_84D960AC (graasp-dev-postgres/graasp-dev-db-allow-collab): Refreshing state... [id=sgr-025c50d209417f463]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-postgres_graasp-dev-db-allow-all_0D9DEE53 (graasp-dev-postgres/graasp-dev-db-allow-all): Refreshing state... [id=sgr-0b1d7df1d0b572110]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-umami-allow-all (graasp-dev-umami-allow-all): Refreshing state... [id=sgr-0a4b672f07f1f7f06]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-umami_425B5740 (graasp-dev-postgres/graasp-dev-db-allow-umami): Refreshing state... [id=sgr-0cb47913649149e5e]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-umami-allow-load-balancer (graasp-dev-umami-allow-load-balancer): Refreshing state... [id=sgr-033af50dc63b13835]
graasp-dev  aws_s3_bucket_cors_configuration.graasp-dev-file-items_s3-cors-config_531774F3 (graasp-dev-file-items/s3-cors-config): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-file-items_s3-bucket-ownership_9BB45BB8 (graasp-dev-file-items/s3-bucket-ownership): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-file-items_s3-block-public-access_DD6519C0 (graasp-dev-file-items/s3-block-public-access): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-meilisearch-allow-all (graasp-dev-meilisearch-allow-all): Refreshing state... [id=sgr-0c557c5df90d9f78f]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-meilisearch-allow-graasp-workers (graasp-dev-meilisearch-allow-graasp-workers): Refreshing state... [id=sgr-07134fbc48d9f0370]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-meilisearch-allow-graasp-backend (graasp-dev-meilisearch-allow-graasp-backend): Refreshing state... [id=sgr-0a2b0a600a592bbd8]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-h5p_s3-block-public-access_2D472005 (graasp-dev-h5p/s3-block-public-access): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-h5p_s3-website-configuration_5FB93898 (graasp-dev-h5p/s3-website-configuration): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-h5p_s3-bucket-ownership_418B795B (graasp-dev-h5p/s3-bucket-ownership): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  data.aws_iam_policy_document.graasp-dev-h5p_allow_public_access_04C01E9A (graasp-dev-h5p/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-h5p_allow_public_access_04C01E9A (graasp-dev-h5p/allow_public_access): Read complete after 0s [id=1897348743]
graasp-dev  aws_s3_bucket_cors_configuration.graasp-dev-h5p_s3-cors-config_EC778FA8 (graasp-dev-h5p/s3-cors-config): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-library-allow-all (graasp-dev-library-allow-all): Refreshing state... [id=sgr-0acf665253d4a959e]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-library-allow-load-balancer (graasp-dev-library-allow-load-balancer): Refreshing state... [id=sgr-04e5abe17e05bdb43]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-apps_s3-website-configuration_7E3F72D4 (graasp-dev-apps/s3-website-configuration): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-apps_s3-bucket-ownership_699CAAD9 (graasp-dev-apps/s3-bucket-ownership): Refreshing state... [id=graasp-dev-apps]
graasp-dev  data.aws_iam_policy_document.graasp-dev-apps_allow_public_access_9E010C09 (graasp-dev-apps/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-apps_allow_public_access_9E010C09 (graasp-dev-apps/allow_public_access): Read complete after 0s [id=4070198440]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-apps_s3-block-public-access_05DA1D21 (graasp-dev-apps/s3-block-public-access): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-allow-gatekeeper-on-meilisearch (graasp-dev-allow-gatekeeper-on-meilisearch): Refreshing state... [id=sgr-085ff897e11bd0fb9]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-allow-gatekeeper-on-postgres (graasp-dev-allow-gatekeeper-on-postgres): Refreshing state... [id=sgr-0f51375e8183b1850]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-gatekeeper_graasp-dev-gatekeeper-allow-inbound-ssh_1B8A7117 (graasp-dev-gatekeeper/graasp-dev-gatekeeper/graasp-dev-gatekeeper-allow-inbound-ssh): Refreshing state... [id=sgr-0f7356c9cf32076cb]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-gatekeeper_graasp-dev-gatekeeper-allow-all_B66B414C (graasp-dev-gatekeeper/graasp-dev-gatekeeper-allow-all): Refreshing state... [id=sgr-0b8bcf954253fa037]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-iframely-allow-all (graasp-dev-iframely-allow-all): Refreshing state... [id=sgr-058fd07c2e3c0ca9c]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-iframely-allow-graasp-backend (graasp-dev-iframely-allow-graasp-backend): Refreshing state... [id=sgr-077d8da6e2cc0d208]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-maintenance_s3-website-configuration_50149944 (graasp-dev-maintenance/s3-website-configuration): Refreshing state... [id=graasp-dev-maintenance]
            aws_s3_bucket_ownership_controls.graasp-dev-maintenance_s3-bucket-ownership_1588A828 (graasp-dev-maintenance/s3-bucket-ownership): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  data.aws_iam_policy_document.graasp-dev-maintenance_allow_public_access_8F6F3848 (graasp-dev-maintenance/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-maintenance_allow_public_access_8F6F3848 (graasp-dev-maintenance/allow_public_access): Read complete after 0s [id=2448502661]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-maintenance_s3-block-public-access_C8FD87F8 (graasp-dev-maintenance/s3-block-public-access): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c2145269b26cde3d]
graasp-dev  module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-043bdec968b8bf547]
graasp-dev  module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0c8012f7c5ce4295b]
graasp-dev  module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0ba3740950e70cb0c1080289494]
graasp-dev  aws_s3_bucket_policy.graasp-dev-client_s3-policy_71B89D07 (graasp-dev-client/s3-policy): Refreshing state... [id=graasp-dev-client]
graasp-dev  data.aws_iam_policy_document.graasp-dev-assets_allow_public_access_59580A32 (graasp-dev-assets/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-assets_allow_public_access_59580A32 (graasp-dev-assets/allow_public_access): Read complete after 0s [id=661570887]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-assets_s3-website-configuration_6D1735B5 (graasp-dev-assets/s3-website-configuration): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-assets_s3-bucket-ownership_1BE1C46A (graasp-dev-assets/s3-bucket-ownership): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-assets_s3-block-public-access_D15DF7EF (graasp-dev-assets/s3-block-public-access): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_s3_bucket_policy.graasp-dev-h5p_s3-policy_9DB0282E (graasp-dev-h5p/s3-policy): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_cloudfront_distribution.graasp-dev-client-cloudfront (graasp-dev-client-cloudfront): Refreshing state... [id=E1ZTGZST8787TH]
graasp-dev  aws_s3_bucket_policy.graasp-dev-apps_s3-policy_708B7B00 (graasp-dev-apps/s3-policy): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_s3_bucket_policy.graasp-dev-maintenance_s3-policy_DA8583B1 (graasp-dev-maintenance/s3-policy): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_cloudfront_distribution.graasp-dev-h5p-cloudfront (graasp-dev-h5p-cloudfront): Refreshing state... [id=E3B7XJV46O4VB4]
graasp-dev  aws_ecs_service.graasp-dev_redis-service_1DBE7C83 (graasp-dev/redis-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/redis]
graasp-dev  aws_lb.graasp-dev-load-balancer_lb_9A06B77C (graasp-dev-load-balancer/lb): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:loadbalancer/app/graasp-dev/56a9113b6597302d]
graasp-dev  aws_ecs_service.graasp-dev_meilisearch-service_3A736F80 (graasp-dev/meilisearch-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/meilisearch]
graasp-dev  aws_instance.graasp-dev-gatekeeper_graasp-dev-gatekeeper-ec2_A55DD5DA (graasp-dev-gatekeeper/graasp-dev-gatekeeper/graasp-dev-gatekeeper-ec2): Refreshing state... [id=i-083a7df3c14e7f171]
graasp-dev  aws_instance.graasp-dev-collab-ec2_graasp-dev-collab-ec2-ec2_21E539AF (graasp-dev-collab-ec2/graasp-dev-collab-ec2/graasp-dev-collab-ec2-ec2): Refreshing state... [id=i-010fb0f2995015d49]
graasp-dev  aws_ecs_service.graasp-dev_iframely-service_8F7B5C1F (graasp-dev/iframely-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/iframely]
graasp-dev  aws_cloudfront_distribution.graasp-dev-apps-cloudfront (graasp-dev-apps-cloudfront): Refreshing state... [id=E354WPS1CZ652D]
graasp-dev  aws_s3_bucket_policy.graasp-dev-assets_s3-policy_B5DD3F7D (graasp-dev-assets/s3-policy): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_cloudfront_distribution.graasp-dev-maintenance-cloudfront (graasp-dev-maintenance-cloudfront): Refreshing state... [id=EGBVR5KHBTMNX]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=graasp-dev-20250414081855174100000001]
graasp-dev  aws_cloudfront_distribution.graasp-dev-assets-cloudfront (graasp-dev-assets-cloudfront): Refreshing state... [id=E1TTPMNH8QPMJP]
graasp-dev  aws_lb_listener.graasp-dev-load-balancer_lb-listener-http-redirect_309E2C64 (graasp-dev-load-balancer/lb-listener-http-redirect): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener/app/graasp-dev/56a9113b6597302d/dfc9fe7ce2ba4ccb]
graasp-dev  aws_lb_listener.graasp-dev-load-balancer_lb-listener-https_E069C227 (graasp-dev-load-balancer/lb-listener-https): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-CBDUST2Z7F3GRTCVXX4RJPFEXY]
graasp-dev  aws_ecs_task_definition.graasp-dev_umami_88984772 (graasp-dev/umami): Refreshing state... [id=umami]
graasp-dev  aws_ecs_task_definition.graasp-dev_migrate-task-definition_44AD51A2 (graasp-dev/migrate-task-definition): Refreshing state... [id=migrate]
graasp-dev  aws_ecs_task_definition.graasp-dev_workers_516311C6 (graasp-dev/workers): Refreshing state... [id=workers]
            aws_ecs_task_definition.graasp-dev_etherpad_D664EB2D (graasp-dev/etherpad): Refreshing state... [id=etherpad]
            aws_ecs_task_definition.graasp-dev_graasp_54E40EB5 (graasp-dev/graasp): Refreshing state... [id=graasp]
graasp-dev  aws_lb_target_group.graasp-dev_etherpad-target-group_94F8091C (graasp-dev/etherpad-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/etherpad/c311d4269d04f108]
            aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-shortener_2A4B0FBC (graasp-dev-load-balancer/graasp-dev-shortener): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/c39ba7c2d5b6bbef]
graasp-dev  aws_lb_target_group.graasp-dev_umami-target-group_02AC6A93 (graasp-dev/umami-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/umami/77272badc864c038]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-builder_4D040462 (graasp-dev-load-balancer/graasp-dev-builder): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/4b57545bd7c09fa1]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-player_6D261351 (graasp-dev-load-balancer/graasp-dev-player): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/886734ff71834f83]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-analytics_431AD7A3 (graasp-dev-load-balancer/graasp-dev-analytics): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/b607a2be8a64b9a1]
graasp-dev  aws_lb_target_group.graasp-dev-collab-ec2_graasp-dev-collab-ec2-target-group_18F9878E (graasp-dev-collab-ec2/graasp-dev-collab-ec2-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp-dev-collab-ec2/0caa23e50a1abee9]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-account_E8E1BF85 (graasp-dev-load-balancer/graasp-dev-account): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/479dd05beed6f5d7]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-auth_E1CC888F (graasp-dev-load-balancer/graasp-dev-auth): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/ce14b1dabb320fe5]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-association_09BDA0F8 (graasp-dev-load-balancer/graasp-dev-association): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/5eec4df5716c0849]
graasp-dev  aws_lb_target_group.graasp-dev_graasp-target-group_7E05BC31 (graasp-dev/graasp-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp/c888b92d0abf031c]
graasp-dev  aws_lb_target_group.graasp-dev_graasp-library-target-group_47035354 (graasp-dev/graasp-library-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp-library/09aa407d374eeee4]
graasp-dev  aws_ecs_service.graasp-dev_workers-service_05D25197 (graasp-dev/workers-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/workers]
graasp-dev  aws_lb_listener_rule.graasp-dev_etherpad-rule_74CA3679 (graasp-dev/etherpad-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/1b021896eed36d28]
graasp-dev  aws_ecs_service.graasp-dev_etherpad-service_366B5CFC (graasp-dev/etherpad-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/etherpad]
graasp-dev  aws_ecs_service.graasp-dev_umami-service_6A875906 (graasp-dev/umami-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/umami]
graasp-dev  aws_lb_listener_rule.graasp-dev_umami-rule_139819E3 (graasp-dev/umami-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/4ff1443c29e346a6]
graasp-dev  aws_lb_listener_rule.graasp-dev-collab-ec2_graasp-dev-collab-ec2-rule_6E87D208 (graasp-dev-collab-ec2/graasp-dev-collab-ec2-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/7eb207705573ff68]
graasp-dev  aws_appautoscaling_target.graasp-dev_workers-service-autoscaling-target_9102DCDC (graasp-dev/workers-service-autoscaling-target): Refreshing state... [id=service/graasp-dev/workers]
graasp-dev  aws_lb_listener_rule.graasp-dev_graasp-rule_8589AD50 (graasp-dev/graasp-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/a861aca569be4e5b]
graasp-dev  aws_ecs_service.graasp-dev_graasp-service_BD538BD2 (graasp-dev/graasp-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/graasp]
            aws_lb_listener_rule.graasp-dev_graasp-library-rule_AC381C09 (graasp-dev/graasp-library-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/414e93764bf83448]
graasp-dev  aws_ecs_service.graasp-dev_graasp-library-service_35621E15 (graasp-dev/graasp-library-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/graasp-library]
graasp-dev  aws_appautoscaling_target.graasp-dev_graasp-library-service-autoscaling-target_5E0ABD4D (graasp-dev/graasp-library-service-autoscaling-target): Refreshing state... [id=service/graasp-dev/graasp-library]
graasp-dev  aws_appautoscaling_target.graasp-dev_graasp-service-autoscaling-target_517CCDCE (graasp-dev/graasp-service-autoscaling-target): Refreshing state... [id=service/graasp-dev/graasp]
graasp-dev  aws_lb_target_group_attachment.graasp-dev-collab-ec2_graasp-dev-collab-ec2-target-group-attachement_E18BD97B (graasp-dev-collab-ec2/graasp-dev-collab-ec2-target-group-attachement): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp-dev-collab-ec2/0caa23e50a1abee9-20250811145659683100000001]
graasp-dev  aws_ec2_instance_state.graasp-dev-collab-ec2_graasp-dev-collab-ec2-state_9B7E66CC (graasp-dev-collab-ec2/graasp-dev-collab-ec2/graasp-dev-collab-ec2-state): Refreshing state... [id=i-010fb0f2995015d49]
graasp-dev  aws_ec2_instance_state.graasp-dev-gatekeeper_graasp-dev-gatekeeper-state_94AC11BD (graasp-dev-gatekeeper/graasp-dev-gatekeeper/graasp-dev-gatekeeper-state): Refreshing state... [id=i-083a7df3c14e7f171]
graasp-dev  aws_appautoscaling_policy.graasp-dev_workers-service-autoscaling-policy_F3FE6A26 (graasp-dev/workers-service-autoscaling-policy): Refreshing state... [id=workers]
graasp-dev  aws_appautoscaling_policy.graasp-dev_graasp-library-service-autoscaling-policy_E718A88F (graasp-dev/graasp-library-service-autoscaling-policy): Refreshing state... [id=graasp-library]
graasp-dev  aws_appautoscaling_policy.graasp-dev_graasp-service-autoscaling-policy_70C429DA (graasp-dev/graasp-service-autoscaling-policy): Refreshing state... [id=graasp]
graasp-dev  Terraform used the selected providers to generate the following execution
            plan. Resource actions are indicated with the following symbols:
              ~ update in-place
              - destroy
            -/+ destroy and then create replacement

            Terraform will perform the following actions:
graasp-dev  # aws_cloudwatch_log_group.graasp-dev_admin-admin-loggroup_BBF3EA20 will be destroyed
              # (because aws_cloudwatch_log_group.graasp-dev_admin-admin-loggroup_BBF3EA20 is not in configuration)
              - resource "aws_cloudwatch_log_group" "graasp-dev_admin-admin-loggroup_BBF3EA20" {
                  - arn               = "arn:aws:logs:eu-central-1:299720865162:log-group:/ecs/admin" -> null
                  - id                = "/ecs/admin" -> null
                  - log_group_class   = "STANDARD" -> null
                  - name              = "/ecs/admin" -> null
                  - retention_in_days = 30 -> null
                  - skip_destroy      = false -> null
                  - tags              = {} -> null
                  - tags_all          = {
                      - "terraform-managed" = "true"
                    } -> null
                    # (2 unchanged attributes hidden)
                }

              # aws_ecr_lifecycle_policy.graasp-dev-admin-ecr-lifecycle will be destroyed
              # (because aws_ecr_lifecycle_policy.graasp-dev-admin-ecr-lifecycle is not in configuration)
              - resource "aws_ecr_lifecycle_policy" "graasp-dev-admin-ecr-lifecycle" {
                  - id          = "graasp/admin" -> null
                  - policy      = jsonencode(
                        {
                          - rules = [
                              - {
                                  - action       = {
                                      - type = "expire"
                                    }
                                  - rulePriority = 1
                                  - selection    = {
                                      - countNumber = 1
                                      - countType   = "sinceImagePushed"
                                      - countUnit   = "days"
                                      - tagStatus   = "untagged"
                                    }
                                },
                              - {
                                  - action       = {
                                      - type = "expire"
                                    }
                                  - description  = "Keep only the last 2 images"
                                  - rulePriority = 2
                                  - selection    = {
                                      - countNumber = 2
                                      - countType   = "imageCountMoreThan"
                                      - tagStatus   = "any"
                                    }
                                },
                            ]
                        }
                    ) -> null
                  - registry_id = "299720865162" -> null
                  - repository  = "graasp/admin" -> null
                }

              # aws_ecr_repository.graasp-dev-admin-ecr will be destroyed
              # (because aws_ecr_repository.graasp-dev-admin-ecr is not in configuration)
              - resource "aws_ecr_repository" "graasp-dev-admin-ecr" {
                  - arn                  = "arn:aws:ecr:eu-central-1:299720865162:repository/graasp/admin" -> null
                  - id                   = "graasp/admin" -> null
                  - image_tag_mutability = "MUTABLE" -> null
                  - name                 = "graasp/admin" -> null
                  - registry_id          = "299720865162" -> null
                  - repository_url       = "299720865162.dkr.ecr.eu-central-1.amazonaws.com/graasp/admin" -> null
                  - tags                 = {} -> null
                  - tags_all             = {
                      - "terraform-managed" = "true"
                    } -> null

                  - encryption_configuration {
                      - encryption_type = "AES256" -> null
                        # (1 unchanged attribute hidden)
                    }

                  - image_scanning_configuration {
                      - scan_on_push = false -> null
                    }
                }

              # aws_ecs_service.graasp-dev_admin-service_102046E6 will be destroyed
              # (because aws_ecs_service.graasp-dev_admin-service_102046E6 is not in configuration)
              - resource "aws_ecs_service" "graasp-dev_admin-service_102046E6" {
                  - availability_zone_rebalancing      = "DISABLED" -> null
                  - cluster                            = "arn:aws:ecs:eu-central-1:299720865162:cluster/graasp-dev" -> null
                  - deployment_maximum_percent         = 200 -> null
                  - deployment_minimum_healthy_percent = 100 -> null
                  - desired_count                      = 1 -> null
                  - enable_ecs_managed_tags            = false -> null
                  - enable_execute_command             = true -> null
                  - health_check_grace_period_seconds  = 0 -> null
                  - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
                  - id                                 = "arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/admin" -> null
                  - launch_type                        = "FARGATE" -> null
                  - name                               = "admin" -> null
                  - platform_version                   = "LATEST" -> null
                  - propagate_tags                     = "NONE" -> null
                  - scheduling_strategy                = "REPLICA" -> null
                  - tags                               = {} -> null
                  - tags_all                           = {
                      - "terraform-managed" = "true"
                    } -> null
                  - task_definition                    = "arn:aws:ecs:eu-central-1:299720865162:task-definition/admin:8" -> null
                  - triggers                           = {} -> null
                  - wait_for_steady_state              = false -> null

                  - deployment_circuit_breaker {
                      - enable   = false -> null
                      - rollback = false -> null
                    }

                  - deployment_controller {
                      - type = "ECS" -> null
                    }

                  - load_balancer {
                      - container_name   = "admin" -> null
                      - container_port   = 4000 -> null
                      - target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/admin/20b707f926558436" -> null
                        # (1 unchanged attribute hidden)
                    }

                  - network_configuration {
                      - assign_public_ip = true -> null
                      - security_groups  = [
                          - "sg-0f0041b09dfe508dd",
                        ] -> null
                      - subnets          = [
                          - "subnet-01238f26eab523423",
                          - "subnet-03a1732c7868cbe45",
                          - "subnet-0d1e3ea211d674e32",
                        ] -> null
                    }

                  - service_connect_configuration {
                      - enabled   = true -> null
                      - namespace = "arn:aws:servicediscovery:eu-central-1:299720865162:namespace/ns-us3rov3ukfoth5ox" -> null
                    }
                }

              # aws_ecs_service.graasp-dev_etherpad-service_366B5CFC (graasp-dev/etherpad-service) will be updated in-place
              ~ resource "aws_ecs_service" "graasp-dev_etherpad-service_366B5CFC" {
                    id                                 = "arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/etherpad"
                    name                               = "etherpad"
                    tags                               = {}
                  ~ task_definition                    = "arn:aws:ecs:eu-central-1:299720865162:task-definition/etherpad:30" -> (known after apply)
                    # (16 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }

              # aws_ecs_service.graasp-dev_graasp-library-service_35621E15 (graasp-dev/graasp-library-service) will be updated in-place
              ~ resource "aws_ecs_service" "graasp-dev_graasp-library-service_35621E15" {
                    id                                 = "arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/graasp-library"
                    name                               = "graasp-library"
                    tags                               = {}
                  ~ task_definition                    = "arn:aws:ecs:eu-central-1:299720865162:task-definition/graasp-library:256" -> (known after apply)
                    # (16 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }

              # aws_ecs_service.graasp-dev_graasp-service_BD538BD2 (graasp-dev/graasp-service) will be updated in-place
              ~ resource "aws_ecs_service" "graasp-dev_graasp-service_BD538BD2" {
                    id                                 = "arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/graasp"
                    name                               = "graasp"
                    tags                               = {}
                  ~ task_definition                    = "arn:aws:ecs:eu-central-1:299720865162:task-definition/graasp:953" -> (known after apply)
                    # (16 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }

              # aws_ecs_service.graasp-dev_iframely-service_8F7B5C1F (graasp-dev/iframely-service) will be updated in-place
              ~ resource "aws_ecs_service" "graasp-dev_iframely-service_8F7B5C1F" {
                    id                                 = "arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/iframely"
                    name                               = "iframely"
                    tags                               = {}
                  ~ task_definition                    = "arn:aws:ecs:eu-central-1:299720865162:task-definition/iframely:8" -> (known after apply)
                    # (16 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }

              # aws_ecs_service.graasp-dev_meilisearch-service_3A736F80 (graasp-dev/meilisearch-service) will be updated in-place
              ~ resource "aws_ecs_service" "graasp-dev_meilisearch-service_3A736F80" {
                    id                                 = "arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/meilisearch"
                    name                               = "meilisearch"
                    tags                               = {}
                  ~ task_definition                    = "arn:aws:ecs:eu-central-1:299720865162:task-definition/meilisearch:27" -> (known after apply)
                    # (16 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }

              # aws_ecs_service.graasp-dev_redis-service_1DBE7C83 (graasp-dev/redis-service) will be updated in-place
              ~ resource "aws_ecs_service" "graasp-dev_redis-service_1DBE7C83" {
                    id                                 = "arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/redis"
                    name                               = "redis"
                    tags                               = {}
                  ~ task_definition                    = "arn:aws:ecs:eu-central-1:299720865162:task-definition/redis:9" -> (known after apply)
                    # (16 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }

              # aws_ecs_service.graasp-dev_umami-service_6A875906 (graasp-dev/umami-service) will be updated in-place
              ~ resource "aws_ecs_service" "graasp-dev_umami-service_6A875906" {
                    id                                 = "arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/umami"
                    name                               = "umami"
                    tags                               = {}
                  ~ task_definition                    = "arn:aws:ecs:eu-central-1:299720865162:task-definition/umami:22" -> (known after apply)
                    # (16 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }

              # aws_ecs_service.graasp-dev_workers-service_05D25197 (graasp-dev/workers-service) will be updated in-place
              ~ resource "aws_ecs_service" "graasp-dev_workers-service_05D25197" {
                    id                                 = "arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/workers"
                    name                               = "workers"
                    tags                               = {}
                  ~ task_definition                    = "arn:aws:ecs:eu-central-1:299720865162:task-definition/workers:135" -> (known after apply)
                    # (16 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }

              # aws_ecs_task_definition.graasp-dev_admin_965ADA45 will be destroyed
              # (because aws_ecs_task_definition.graasp-dev_admin_965ADA45 is not in configuration)
              - resource "aws_ecs_task_definition" "graasp-dev_admin_965ADA45" {
                  - arn                      = "arn:aws:ecs:eu-central-1:299720865162:task-definition/admin:8" -> null
                  - arn_without_revision     = "arn:aws:ecs:eu-central-1:299720865162:task-definition/admin" -> null
                  - container_definitions    = (sensitive value) -> null
                  - cpu                      = "256" -> null
                  - enable_fault_injection   = false -> null
                  - execution_role_arn       = "arn:aws:iam::299720865162:role/graasp-dev-ecs-execution-role" -> null
                  - family                   = "admin" -> null
                  - id                       = "admin" -> null
                  - memory                   = "512" -> null
                  - network_mode             = "awsvpc" -> null
                  - requires_compatibilities = [
                      - "FARGATE",
                    ] -> null
                  - revision                 = 8 -> null
                  - skip_destroy             = false -> null
                  - tags_all                 = {
                      - "terraform-managed" = "true"
                    } -> null
                  - task_role_arn            = "arn:aws:iam::299720865162:role/admin-ecsExec-task-role" -> null
                  - track_latest             = false -> null
                    # (2 unchanged attributes hidden)

                  - runtime_platform {
                      - cpu_architecture        = "ARM64" -> null
                      - operating_system_family = "LINUX" -> null
                    }
                }

              # aws_ecs_task_definition.graasp-dev_etherpad_D664EB2D (graasp-dev/etherpad) must be replaced
            -/+ resource "aws_ecs_task_definition" "graasp-dev_etherpad_D664EB2D" {
                  ~ arn                      = "arn:aws:ecs:eu-central-1:299720865162:task-definition/etherpad:30" -> (known after apply)
                  ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:299720865162:task-definition/etherpad" -> (known after apply)
                  ~ container_definitions    = (sensitive value)
                  ~ enable_fault_injection   = false -> (known after apply)
                  ~ id                       = "etherpad" -> (known after apply)
                  ~ revision                 = 30 -> (known after apply)
                  - tags                     = {} -> null
                    # (12 unchanged attributes hidden)

                  - runtime_platform { # forces replacement
                      - cpu_architecture        = "X86_64" -> null # forces replacement
                      - operating_system_family = "LINUX" -> null # forces replacement
                    }
                }

              # aws_ecs_task_definition.graasp-dev_graasp-library_B38B90C0 (graasp-dev/graasp-library) must be replaced
            -/+ resource "aws_ecs_task_definition" "graasp-dev_graasp-library_B38B90C0" {
                  ~ arn                      = "arn:aws:ecs:eu-central-1:299720865162:task-definition/graasp-library:256" -> (known after apply)
                  ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:299720865162:task-definition/graasp-library" -> (known after apply)
                  ~ container_definitions    = jsonencode(
                      ~ [
                          ~ {
                              - essential        = true
                              - mountPoints      = []
                                name             = "graasp-library"
                              ~ portMappings     = [
                                  ~ {
                                        name          = "graasp-library-3000-tcp"
                                      - protocol      = "tcp"
                                        # (2 unchanged attributes hidden)
                                    },
                                ]
                              - systemControls   = []
                              - volumesFrom      = []
                                # (3 unchanged attributes hidden)
                            },
                        ]
                    )
                  ~ enable_fault_injection   = false -> (known after apply)
                  ~ id                       = "graasp-library" -> (known after apply)
                  ~ revision                 = 256 -> (known after apply)
                  - tags                     = {} -> null
                    # (12 unchanged attributes hidden)

                  - runtime_platform { # forces replacement
                      - cpu_architecture        = "X86_64" -> null # forces replacement
                      - operating_system_family = "LINUX" -> null # forces replacement
                    }
                }

              # aws_ecs_task_definition.graasp-dev_graasp_54E40EB5 (graasp-dev/graasp) must be replaced
            -/+ resource "aws_ecs_task_definition" "graasp-dev_graasp_54E40EB5" {
                  ~ arn                      = "arn:aws:ecs:eu-central-1:299720865162:task-definition/graasp:953" -> (known after apply)
                  ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:299720865162:task-definition/graasp" -> (known after apply)
                  ~ container_definitions    = (sensitive value)
                  ~ enable_fault_injection   = false -> (known after apply)
                  ~ id                       = "graasp" -> (known after apply)
                  ~ revision                 = 953 -> (known after apply)
                  - tags                     = {} -> null
                    # (12 unchanged attributes hidden)

                  - runtime_platform { # forces replacement
                      - cpu_architecture        = "X86_64" -> null # forces replacement
                      - operating_system_family = "LINUX" -> null # forces replacement
                    }
                }

              # aws_ecs_task_definition.graasp-dev_iframely_4C5E8E3D (graasp-dev/iframely) must be replaced
            -/+ resource "aws_ecs_task_definition" "graasp-dev_iframely_4C5E8E3D" {
                  ~ arn                      = "arn:aws:ecs:eu-central-1:299720865162:task-definition/iframely:8" -> (known after apply)
                  ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:299720865162:task-definition/iframely" -> (known after apply)
                  ~ container_definitions    = jsonencode(
                      ~ [
                          ~ {
                              - essential        = true
                              - mountPoints      = []
                                name             = "iframely"
                              ~ portMappings     = [
                                  ~ {
                                        name          = "iframely-8061-tcp"
                                      - protocol      = "tcp"
                                        # (2 unchanged attributes hidden)
                                    },
                                ]
                              - systemControls   = []
                              - volumesFrom      = []
                                # (3 unchanged attributes hidden)
                            },
                        ]
                    )
                  ~ enable_fault_injection   = false -> (known after apply)
                  ~ id                       = "iframely" -> (known after apply)
                  ~ revision                 = 8 -> (known after apply)
                  - tags                     = {} -> null
                    # (12 unchanged attributes hidden)

                  - runtime_platform { # forces replacement
                      - cpu_architecture        = "X86_64" -> null # forces replacement
                      - operating_system_family = "LINUX" -> null # forces replacement
                    }
                }

              # aws_ecs_task_definition.graasp-dev_meilisearch_38A3D0B6 (graasp-dev/meilisearch) must be replaced
            -/+ resource "aws_ecs_task_definition" "graasp-dev_meilisearch_38A3D0B6" {
                  ~ arn                      = "arn:aws:ecs:eu-central-1:299720865162:task-definition/meilisearch:27" -> (known after apply)
                  ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:299720865162:task-definition/meilisearch" -> (known after apply)
                  ~ container_definitions    = (sensitive value)
                  ~ enable_fault_injection   = false -> (known after apply)
                  ~ id                       = "meilisearch" -> (known after apply)
                  ~ revision                 = 27 -> (known after apply)
                  - tags                     = {} -> null
                    # (12 unchanged attributes hidden)

                  - runtime_platform { # forces replacement
                      - cpu_architecture        = "X86_64" -> null # forces replacement
                      - operating_system_family = "LINUX" -> null # forces replacement
                    }
                }

              # aws_ecs_task_definition.graasp-dev_redis_E9CE963D (graasp-dev/redis) must be replaced
            -/+ resource "aws_ecs_task_definition" "graasp-dev_redis_E9CE963D" {
                  ~ arn                      = "arn:aws:ecs:eu-central-1:299720865162:task-definition/redis:9" -> (known after apply)
                  ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:299720865162:task-definition/redis" -> (known after apply)
                  ~ container_definitions    = jsonencode(
                      ~ [
                          ~ {
                              - essential        = true
                              - mountPoints      = []
                                name             = "redis"
                              ~ portMappings     = [
                                  ~ {
                                        name          = "redis-6379-tcp"
                                      - protocol      = "tcp"
                                        # (2 unchanged attributes hidden)
                                    },
                                ]
                              - systemControls   = []
                              - volumesFrom      = []
                                # (3 unchanged attributes hidden)
                            },
                        ]
                    )
                  ~ enable_fault_injection   = false -> (known after apply)
                  ~ id                       = "redis" -> (known after apply)
                  ~ revision                 = 9 -> (known after apply)
                  - tags                     = {} -> null
                    # (12 unchanged attributes hidden)

                  - runtime_platform { # forces replacement
                      - cpu_architecture        = "X86_64" -> null # forces replacement
                      - operating_system_family = "LINUX" -> null # forces replacement
                    }
                }

              # aws_ecs_task_definition.graasp-dev_umami_88984772 (graasp-dev/umami) must be replaced
            -/+ resource "aws_ecs_task_definition" "graasp-dev_umami_88984772" {
                  ~ arn                      = "arn:aws:ecs:eu-central-1:299720865162:task-definition/umami:22" -> (known after apply)
                  ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:299720865162:task-definition/umami" -> (known after apply)
                  ~ container_definitions    = (sensitive value)
                  ~ enable_fault_injection   = false -> (known after apply)
                  ~ id                       = "umami" -> (known after apply)
                  ~ revision                 = 22 -> (known after apply)
                  - tags                     = {} -> null
                    # (12 unchanged attributes hidden)

                  - runtime_platform { # forces replacement
                      - cpu_architecture        = "X86_64" -> null # forces replacement
                      - operating_system_family = "LINUX" -> null # forces replacement
                    }
                }

              # aws_ecs_task_definition.graasp-dev_workers_516311C6 (graasp-dev/workers) must be replaced
            -/+ resource "aws_ecs_task_definition" "graasp-dev_workers_516311C6" {
                  ~ arn                      = "arn:aws:ecs:eu-central-1:299720865162:task-definition/workers:135" -> (known after apply)
                  ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:299720865162:task-definition/workers" -> (known after apply)
                  ~ container_definitions    = (sensitive value)
                  ~ enable_fault_injection   = false -> (known after apply)
                  ~ id                       = "workers" -> (known after apply)
                  ~ revision                 = 135 -> (known after apply)
                  - tags                     = {} -> null
                    # (12 unchanged attributes hidden)

                  - runtime_platform { # forces replacement
                      - cpu_architecture        = "X86_64" -> null # forces replacement
                      - operating_system_family = "LINUX" -> null # forces replacement
                    }
                }

              # aws_iam_role.graasp-dev_admin-ecsExec-task-role_4A498ED2 will be destroyed
              # (because aws_iam_role.graasp-dev_admin-ecsExec-task-role_4A498ED2 is not in configuration)
              - resource "aws_iam_role" "graasp-dev_admin-ecsExec-task-role_4A498ED2" {
                  - arn                   = "arn:aws:iam::299720865162:role/admin-ecsExec-task-role" -> null
                  - assume_role_policy    = jsonencode(
                        {
                          - Statement = [
                              - {
                                  - Action    = "sts:AssumeRole"
                                  - Effect    = "Allow"
                                  - Principal = {
                                      - Service = "ecs-tasks.amazonaws.com"
                                    }
                                  - Sid       = ""
                                },
                            ]
                          - Version   = "2012-10-17"
                        }
                    ) -> null
                  - create_date           = "2025-09-01T07:27:34Z" -> null
                  - force_detach_policies = false -> null
                  - id                    = "admin-ecsExec-task-role" -> null
                  - managed_policy_arns   = [] -> null
                  - max_session_duration  = 3600 -> null
                  - name                  = "admin-ecsExec-task-role" -> null
                  - path                  = "/" -> null
                  - tags_all              = {
                      - "terraform-managed" = "true"
                    } -> null
                  - unique_id             = "AROAULSGBOWFB2ASN33LM" -> null
                    # (3 unchanged attributes hidden)
                }

              # aws_iam_role_policy.graasp-dev_admin-ecsExec-task-policy_8B69D2B0 will be destroyed
              # (because aws_iam_role_policy.graasp-dev_admin-ecsExec-task-policy_8B69D2B0 is not in configuration)
              - resource "aws_iam_role_policy" "graasp-dev_admin-ecsExec-task-policy_8B69D2B0" {
                  - id          = "admin-ecsExec-task-role:admin-allow-ecsExec-task-policy" -> null
                  - name        = "admin-allow-ecsExec-task-policy" -> null
                  - policy      = jsonencode(
                        {
                          - Statement = [
                              - {
                                  - Action   = [
                                      - "ssmmessages:CreateControlChannel",
                                      - "ssmmessages:CreateDataChannel",
                                      - "ssmmessages:OpenControlChannel",
                                      - "ssmmessages:OpenDataChannel",
                                    ]
                                  - Effect   = "Allow"
                                  - Resource = "*"
                                },
                            ]
                          - Version   = "2012-10-17"
                        }
                    ) -> null
                  - role        = "admin-ecsExec-task-role" -> null
                    # (1 unchanged attribute hidden)
                }

              # aws_instance.graasp-dev-collab-ec2_graasp-dev-collab-ec2-ec2_21E539AF (graasp-dev-collab-ec2/graasp-dev-collab-ec2/graasp-dev-collab-ec2-ec2) will be updated in-place
              ~ resource "aws_instance" "graasp-dev-collab-ec2_graasp-dev-collab-ec2-ec2_21E539AF" {
                    id                                   = "i-010fb0f2995015d49"
                    tags                                 = {
                        "Name" = "graasp-dev-collab-ec2"
                    }
                  ~ user_data                            = "182b4e0cd42f91053c17d3da31c852f61c5b1c22" -> "2b5238107faa4cfa57ba3f50c249d59cc765b21c"
                    # (39 unchanged attributes hidden)

                    # (8 unchanged blocks hidden)
                }

              # aws_instance.graasp-dev-gatekeeper_graasp-dev-gatekeeper-ec2_A55DD5DA (graasp-dev-gatekeeper/graasp-dev-gatekeeper/graasp-dev-gatekeeper-ec2) will be updated in-place
              ~ resource "aws_instance" "graasp-dev-gatekeeper_graasp-dev-gatekeeper-ec2_A55DD5DA" {
                    id                                   = "i-083a7df3c14e7f171"
                    tags                                 = {
                        "Name" = "graasp-dev-gatekeeper"
                    }
                  ~ user_data                            = "8640789d2f88e9468e62b63d0bb7a8bf3308b114" -> "6799854af52dbf80d97d62f8849938a9847ec9c4"
                    # (39 unchanged attributes hidden)

                    # (8 unchanged blocks hidden)
                }

              # aws_lb_listener_rule.graasp-dev_admin-rule_5C1B7745 will be destroyed
              # (because aws_lb_listener_rule.graasp-dev_admin-rule_5C1B7745 is not in configuration)
              - resource "aws_lb_listener_rule" "graasp-dev_admin-rule_5C1B7745" {
                  - arn          = "arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/353fcd477349a6a0" -> null
                  - id           = "arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/353fcd477349a6a0" -> null
                  - listener_arn = "arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7" -> null
                  - priority     = 8 -> null
                  - tags         = {} -> null
                  - tags_all     = {
                      - "terraform-managed" = "true"
                    } -> null

                  - action {
                      - order            = 1 -> null
                      - target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/admin/20b707f926558436" -> null
                      - type             = "forward" -> null
                    }

                  - condition {
                      - host_header {
                          - values = [
                              - "admin.dev.graasp.org",
                            ] -> null
                        }
                    }
                }

              # aws_lb_target_group.graasp-dev_admin-target-group_02D6E066 will be destroyed
              # (because aws_lb_target_group.graasp-dev_admin-target-group_02D6E066 is not in configuration)
              - resource "aws_lb_target_group" "graasp-dev_admin-target-group_02D6E066" {
                  - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/admin/20b707f926558436" -> null
                  - arn_suffix                         = "targetgroup/admin/20b707f926558436" -> null
                  - deregistration_delay               = "300" -> null
                  - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/admin/20b707f926558436" -> null
                  - ip_address_type                    = "ipv4" -> null
                  - lambda_multi_value_headers_enabled = false -> null
                  - load_balancer_arns                 = [
                      - "arn:aws:elasticloadbalancing:eu-central-1:299720865162:loadbalancer/app/graasp-dev/56a9113b6597302d",
                    ] -> null
                  - load_balancing_algorithm_type      = "round_robin" -> null
                  - load_balancing_anomaly_mitigation  = "off" -> null
                  - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
                  - name                               = "admin" -> null
                  - port                               = 80 -> null
                  - protocol                           = "HTTP" -> null
                  - protocol_version                   = "HTTP1" -> null
                  - proxy_protocol_v2                  = false -> null
                  - slow_start                         = 0 -> null
                  - tags                               = {} -> null
                  - tags_all                           = {
                      - "terraform-managed" = "true"
                    } -> null
                  - target_type                        = "ip" -> null
                  - vpc_id                             = "vpc-0bf44cfeb4bd6c5a3" -> null
                    # (1 unchanged attribute hidden)

                  - health_check {
                      - enabled             = true -> null
                      - healthy_threshold   = 3 -> null
                      - interval            = 60 -> null
                      - matcher             = "200" -> null
                      - path                = "/up" -> null
                      - port                = "traffic-port" -> null
                      - protocol            = "HTTP" -> null
                      - timeout             = 6 -> null
                      - unhealthy_threshold = 3 -> null
                    }

                  - stickiness {
                      - cookie_duration = 86400 -> null
                      - enabled         = false -> null
                      - type            = "lb_cookie" -> null
                        # (1 unchanged attribute hidden)
                    }

                  - target_failover {}

                  - target_group_health {
                      - dns_failover {
                          - minimum_healthy_targets_count      = "1" -> null
                          - minimum_healthy_targets_percentage = "off" -> null
                        }
                      - unhealthy_state_routing {
                          - minimum_healthy_targets_count      = 1 -> null
                          - minimum_healthy_targets_percentage = "off" -> null
                        }
                    }

                  - target_health_state {}
                }

              # aws_security_group.graasp-dev-admin-security-group will be destroyed
              # (because aws_security_group.graasp-dev-admin-security-group is not in configuration)
              - resource "aws_security_group" "graasp-dev-admin-security-group" {
                  - arn                    = "arn:aws:ec2:eu-central-1:299720865162:security-group/sg-0f0041b09dfe508dd" -> null
                  - description            = "Managed by Terraform" -> null
                  - egress                 = [
                      - {
                          - cidr_blocks      = [
                              - "0.0.0.0/0",
                            ]
                          - from_port        = 0
                          - ipv6_cidr_blocks = []
                          - prefix_list_ids  = []
                          - protocol         = "-1"
                          - security_groups  = []
                          - self             = false
                          - to_port          = 0
                            # (1 unchanged attribute hidden)
                        },
                    ] -> null
                  - id                     = "sg-0f0041b09dfe508dd" -> null
                  - ingress                = [
                      - {
                          - cidr_blocks      = []
                          - from_port        = 4000
                          - ipv6_cidr_blocks = []
                          - prefix_list_ids  = []
                          - protocol         = "tcp"
                          - security_groups  = [
                              - "sg-043a4fe55b6817b2e",
                            ]
                          - self             = false
                          - to_port          = 4000
                            # (1 unchanged attribute hidden)
                        },
                      - {
                          - cidr_blocks      = []
                          - from_port        = 9000
                          - ipv6_cidr_blocks = []
                          - prefix_list_ids  = []
                          - protocol         = "tcp"
                          - security_groups  = [
                              - "sg-0750d0af113e7da99",
                            ]
                          - self             = false
                          - to_port          = 9000
                            # (1 unchanged attribute hidden)
                        },
                    ] -> null
                  - name                   = "graasp-dev-admin" -> null
                  - owner_id               = "299720865162" -> null
                  - revoke_rules_on_delete = false -> null
                  - tags                   = {} -> null
                  - tags_all               = {
                      - "terraform-managed" = "true"
                    } -> null
                  - vpc_id                 = "vpc-0bf44cfeb4bd6c5a3" -> null
                    # (1 unchanged attribute hidden)
                }

              # aws_vpc_security_group_egress_rule.graasp-dev-admin-allow-all will be destroyed
              # (because aws_vpc_security_group_egress_rule.graasp-dev-admin-allow-all is not in configuration)
              - resource "aws_vpc_security_group_egress_rule" "graasp-dev-admin-allow-all" {
                  - arn                    = "arn:aws:ec2:eu-central-1:299720865162:security-group-rule/sgr-00f1b05233f81218d" -> null
                  - cidr_ipv4              = "0.0.0.0/0" -> null
                  - id                     = "sgr-00f1b05233f81218d" -> null
                  - ip_protocol            = "-1" -> null
                  - security_group_id      = "sg-0f0041b09dfe508dd" -> null
                  - security_group_rule_id = "sgr-00f1b05233f81218d" -> null
                  - tags_all               = {
                      - "terraform-managed" = "true"
                    } -> null
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-admin-allow-load-balancer will be destroyed
              # (because aws_vpc_security_group_ingress_rule.graasp-dev-admin-allow-load-balancer is not in configuration)
              - resource "aws_vpc_security_group_ingress_rule" "graasp-dev-admin-allow-load-balancer" {
                  - arn                          = "arn:aws:ec2:eu-central-1:299720865162:security-group-rule/sgr-00dd0db77b3d87366" -> null
                  - from_port                    = 4000 -> null
                  - id                           = "sgr-00dd0db77b3d87366" -> null
                  - ip_protocol                  = "tcp" -> null
                  - referenced_security_group_id = "sg-043a4fe55b6817b2e" -> null
                  - security_group_id            = "sg-0f0041b09dfe508dd" -> null
                  - security_group_rule_id       = "sgr-00dd0db77b3d87366" -> null
                  - tags_all                     = {
                      - "terraform-managed" = "true"
                    } -> null
                  - to_port                      = 4000 -> null
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-allow-gatekeeper-on-admin will be destroyed
              # (because aws_vpc_security_group_ingress_rule.graasp-dev-allow-gatekeeper-on-admin is not in configuration)
              - resource "aws_vpc_security_group_ingress_rule" "graasp-dev-allow-gatekeeper-on-admin" {
                  - arn                          = "arn:aws:ec2:eu-central-1:299720865162:security-group-rule/sgr-08f6d4ff3e4dffc83" -> null
                  - from_port                    = 9000 -> null
                  - id                           = "sgr-08f6d4ff3e4dffc83" -> null
                  - ip_protocol                  = "tcp" -> null
                  - referenced_security_group_id = "sg-0750d0af113e7da99" -> null
                  - security_group_id            = "sg-0f0041b09dfe508dd" -> null
                  - security_group_rule_id       = "sgr-08f6d4ff3e4dffc83" -> null
                  - tags_all                     = {
                      - "terraform-managed" = "true"
                    } -> null
                  - to_port                      = 9000 -> null
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-admin_04B093C2 will be destroyed
              # (because aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-admin_04B093C2 is not in configuration)
              - resource "aws_vpc_security_group_ingress_rule" "graasp-dev-postgres_graasp-dev-db-allow-admin_04B093C2" {
                  - arn                          = "arn:aws:ec2:eu-central-1:299720865162:security-group-rule/sgr-041fc861dd71454c7" -> null
                  - from_port                    = 5432 -> null
                  - id                           = "sgr-041fc861dd71454c7" -> null
                  - ip_protocol                  = "tcp" -> null
                  - referenced_security_group_id = "sg-0f0041b09dfe508dd" -> null
                  - security_group_id            = "sg-0186fec9af0593f12" -> null
                  - security_group_rule_id       = "sgr-041fc861dd71454c7" -> null
                  - tags_all                     = {
                      - "terraform-managed" = "true"
                    } -> null
                  - to_port                      = 5432 -> null
                }

            Plan: 8 to add, 10 to change, 22 to destroy.

            ─────────────────────────────────────────────────────────────────────────────

            Saved the plan to: plan

            To perform exactly these actions, run the following command to apply:
                terraform apply "plan"


```

</details>